// change

// Событие change срабатывает по окончании изменения элемента.

// Для текстовых <input> это означает, что событие происходит при потере фокуса
// Для других элементов: select, input type=checkbox/radio событие запускается сразу после изменения значения

// input

// Событие input срабатывает каждый раз при изменении значения.

// В отличие от событий клавиатуры, оно работает при любых изменениях значений, даже если они не связаны с клавиатурными действиями: вставка с помощью мыши или распознавание речи при диктовке текста.
// Нельзя ничего предотвратить в oninput

// cut, copy, paste

// Эти события происходят при вырезании/копировании/вставке данных.
// Они относятся к классу ClipboardEvent и обеспечивают доступ к копируемым/вставляемым данным.